# Commented out packages are already installed or optional

## General apps
# cask 'google-chrome'
# cask 'iterm2'
# cask 'slack'
# required sudo access
cask 'zoom'

## Productivity apps
# cask 'logseq'
cask 'clipy'
brew 'tmux'
# required sudo access
# cask 'alinof-timer'
brew 'diff-so-fancy'
brew 'fzf'
brew 'ctags'
tap 'schappim/ocr'
brew 'schappim/ocr/ocr'
brew 'bat'

## Clojure
# required symlink for java to be required
brew 'clojure'
# Needs rosetta
tap 'borkdude/brew'
brew 'borkdude/brew/babashka'
brew 'babashka/brew/bbin'
brew 'borkdude/brew/puget'
brew 'jenv'
brew 'clj-kondo'

## Misc
brew 'magic-wormhole'
brew 'node'
# brew 'graphviz'
brew 'gh'
brew 'git'
