## General apps
cask 'google-chrome'
cask 'iterm2'
cask 'homebrew/cask-versions/atom-beta'
cask 'slack'

## Productivity apps
cask 'logseq'
cask 'clipy'
brew 'tmux'
# required sudo access
cask 'alinof-timer'
cask 'shiori'
brew 'jq'
brew 'diff-so-fancy'
brew 'fzf'
brew 'ctags'
tap 'schappim/ocr'
brew 'schappim/ocr/ocr'
brew 'bat'

## Clojure
# required symlink for java to be required
brew 'clojure'
# Needs rosetta
tap 'borkdude/brew'
brew 'borkdude/brew/babashka'
brew 'babashka/brew/obb'
brew 'borkdude/brew/puget'
brew 'leiningen'
brew 'jenv'
brew 'clj-kondo'

## Misc
cask 'aws-vault'
brew 'awscli'
brew 'magic-wormhole'
brew 'node'
brew 'graphviz'
brew 'gh'
tap 'lucagrulla/tap'
brew 'cw'
brew 'spark'
brew 'git'
cask 'anybar'
