## General apps
cask 'google-chrome'
cask 'iterm2'
cask 'homebrew/cask-versions/atom-beta'
cask 'slack'

## Productivity apps
cask 'logseq'
cask 'clipy'
brew 'tmux'
# required sudo access
cask 'alinof-timer'
cask 'shiori'
brew 'jq'
brew 'diff-so-fancy'

## Clojure
# required symlink for java to be required
brew 'clojure'
# Needs rosetta
tap 'borkdude/brew'
brew 'borkdude/brew/babashka'
brew 'leiningen'
brew 'jenv'
brew 'clj-kondo'

## Misc
cask 'aws-vault'
brew 'awscli'
brew 'magic-wormhole'
brew 'node'
brew 'graphviz'

## Sometimes
# postgresql
# datomic
# keycastr
# gist
# vlc
# ffmpeg
# go
# herrie
# jena
# nvm
# mplayer
# pdfgrep
# pstree
# sqlite
# yarn
# maven
# youtube-dl
# rbenv
# ripgrep
# readline
